---
kind: property
id: P:Autodesk.Revit.DB.ACADExportOptions.LinetypesFileName
source: html/8c81b2a0-e9f9-e3e1-4b07-820ad43d8f22.htm
---
# Autodesk.Revit.DB.ACADExportOptions.LinetypesFileName Property

The custom linetype file name (*.lin).
 Default value is empty.

## Syntax (C#)
```csharp
public string LinetypesFileName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null